## **Session 02 / 09-Oct-2025**

### ***Import the libraries needed in today's program and exercise. `Numpy` and `Pandas`.***

In [1]:
import pandas as pd
import numpy as np

### ***Exercise 1: Write dynamic code that takes three values ​​from the user and uses the `numpy.random.randint()` method to display a series as output using the `pandas.Series()` method.***

In [18]:
a, b, c = 13, 17, 18
gen = np.random.randint(a, b, c)
data = pd.Series(gen)
data

0     14
1     15
2     13
3     15
4     14
5     13
6     14
7     14
8     14
9     13
10    13
11    13
12    14
13    15
14    16
15    13
16    16
17    13
dtype: int32

### ***We created a data using a dictionary. We converted it to a dataframe using the `pandas.DataFrame()` method. We also customized the indexes of the dataframe.***

In [ ]:
data2 = {"Name": ["Ali", "Sara", "Sina", "Dana"],
         "Age": [22, 21, 19, 20],
         "Score": [70, 87, 88, 90],
         "Term": [7, 5, 2, 3],
         "City": ["Esfehan", "Shiraz", "Rasht", "Tehran"]}
df = pd.DataFrame(data2, index=[1, 2, 3, 4])
df

   Name  Age  Score  Term     City
1   Ali   22     70     7  Esfehan
2  Sara   21     87     5   Shiraz
3  Sina   19     88     2    Rasht
4  Dana   20     90     3   Tehran

### ***Using the `dataframe.head()` method, we can view the first five rows of the data frame. This method displays the first five rows by default, but we can change it to display the number of rows we want by giving a specific number.***

In [ ]:
df.head(3)

   Name  Age  Score  Term     City
1   Ali   22     70     7  Esfehan
2  Sara   21     87     5   Shiraz
3  Sina   19     88     2    Rasht

### ***The output of the `dataframe.shape` method is a tuple containing the number of rows and the number of columns.***

In [ ]:
df.shape

(4, 5)

### ***By writing the name of the data frame and writing the name of the desired column in a pair of brackets, we can access the data in that column, the name of that column, and its type.***

In [ ]:
df["City"]

1    Esfehan
2     Shiraz
3      Rasht
4     Tehran
Name: City, dtype: object

### ***To access data related to several columns, if there is more than one column, we use two pairs of nested brackets.***

In [ ]:
df[["Term", "Age", "Name"]]

   Term  Age  Name
1     7   22   Ali
2     5   21  Sara
3     2   19  Sina
4     3   20  Dana

### ***With the following method, we can see in the output the values ​​that apply to the condition written in a column of data.***

In [ ]:
df[df["Age"] > 20]

   Name  Age  Score  Term     City
1   Ali   22     70     7  Esfehan
2  Sara   21     87     5   Shiraz

### ***With the following method, we can see in the output the values ​​that apply to the condition written in the data of a column. We can write more than one condition and also pay attention to the order of the operators.***

In [ ]:
df[(df["Age"] > 20) & (df["City"] == "Shiraz")]

   Name  Age  Score  Term    City
2  Sara   21     87     5  Shiraz

### ***Here we created a 2D array using `numpy.array()`. Using `pandas.DataFrame()` method, we converted the data to a dataframe and customized the row and column names.***

In [ ]:
data3 = np.array([[10, 20, 30],
                  [40, 50, 60],
                  [70, 80, 90]])
pd.DataFrame(data3, columns=["A", "B", "C"], index=["Row1", "Row2", "Row3"])

       A   B   C
Row1  10  20  30
Row2  40  50  60
Row3  70  80  90